; ModuleID = './arch/x86/kernel/rtc.llbc'
source_filename = "arch/x86/kernel/rtc.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22___kcrctab+rtc_lock\22, \22a\22\09"
module asm "\09.weak\09__crc_rtc_lock\09\09\09\09"
module asm "\09.long\09__crc_rtc_lock\09\09\09\09"
module asm "\09.previous\09\09\09\09\09"
module asm "\09.section \22___ksymtab+rtc_lock\22, \22a\22\09"
module asm "\09.balign\098\09\09\09\09\09"
module asm "__ksymtab_rtc_lock:\09\09\09\09"
module asm "\09.long\09rtc_lock- .\09\09\09\09"
module asm "\09.long\09__kstrtab_rtc_lock- .\09\09\09"
module asm "\09.previous\09\09\09\09\09"
module asm "\09.section \22___kcrctab+rtc_cmos_read\22, \22a\22\09"
module asm "\09.weak\09__crc_rtc_cmos_read\09\09\09\09"
module asm "\09.long\09__crc_rtc_cmos_read\09\09\09\09"
module asm "\09.previous\09\09\09\09\09"
module asm "\09.section \22___ksymtab+rtc_cmos_read\22, \22a\22\09"
module asm "\09.balign\098\09\09\09\09\09"
module asm "__ksymtab_rtc_cmos_read:\09\09\09\09"
module asm "\09.long\09rtc_cmos_read- .\09\09\09\09"
module asm "\09.long\09__kstrtab_rtc_cmos_read- .\09\09\09"
module asm "\09.previous\09\09\09\09\09"
module asm "\09.section \22___kcrctab+rtc_cmos_write\22, \22a\22\09"
module asm "\09.weak\09__crc_rtc_cmos_write\09\09\09\09"
module asm "\09.long\09__crc_rtc_cmos_write\09\09\09\09"
module asm "\09.previous\09\09\09\09\09"

!64 = !DIFile(filename: "./include/linux/rcu_sync.h", directory: "/home/qinshisong/clangbuilt-linux")
!65 = !{!66, !67, !68}
!66 = !DIEnumerator(name: "RCU_SYNC", value: 0, isUnsigned: true)
!67 = !DIEnumerator(name: "RCU_SCHED_SYNC", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "RCU_BH_SYNC", value: 2, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rw_hint", file: !70, line: 287, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "./include/linux/fs.h", directory: "/home/qinshisong/clangbuilt-linux")
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIEnumerator(name: "WRITE_LIFE_NOT_SET", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "WRITE_LIFE_NONE", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "WRITE_LIFE_SHORT", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "WRITE_LIFE_MEDIUM", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "WRITE_LIFE_LONG", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "WRITE_LIFE_EXTREME", value: 5, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pid_type", file: !79, line: 7, baseType: !7, size: 32, elements: !80)
!79 = !DIFile(filename: "./include/linux/pid.h", directory: "/home/qinshisong/clangbuilt-linux")
!80 = !{!81, !82, !83, !84, !85}
!81 = !DIEnumerator(name: "PIDTYPE_PID", value: 0, isUnsigned: true)
!82 = !DIEnumerator(name: "PIDTYPE_TGID", value: 1, isUnsigned: true)
!83 = !DIEnumerator(name: "PIDTYPE_PGID", value: 2, isUnsigned: true)
!84 = !DIEnumerator(name: "PIDTYPE_SID", value: 3, isUnsigned: true)
!85 = !DIEnumerator(name: "PIDTYPE_MAX", value: 4, isUnsigned: true)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "probe_type", file: !87, line: 237, baseType: !7, size: 32, elements: !88)
!87 = !DIFile(filename: "./include/linux/device.h", directory: "/home/qinshisong/clangbuilt-linux")
!88 = !{!89, !90, !91}
!89 = !DIEnumerator(name: "PROBE_DEFAULT_STRATEGY", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "PROBE_PREFER_ASYNCHRONOUS", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "PROBE_FORCE_SYNCHRONOUS", value: 2, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dl_dev_state", file: !87, line: 870, baseType: !7, size: 32, elements: !93)
!93 = !{!94, !95, !96, !97}
!94 = !DIEnumerator(name: "DL_DEV_NO_DRIVER", value: 0, isUnsigned: true)
!95 = !DIEnumerator(name: "DL_DEV_PROBING", value: 1, isUnsigned: true)
!96 = !DIEnumerator(name: "DL_DEV_DRIVER_BOUND", value: 2, isUnsigned: true)
!97 = !DIEnumerator(name: "DL_DEV_UNBINDING", value: 3, isUnsigned: true)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_request", file: !99, line: 531, baseType: !7, size: 32, elements: !100)
!99 = !DIFile(filename: "./include/linux/pm.h", directory: "/home/qinshisong/clangbuilt-linux")
!100 = !{!101, !102, !103, !104, !105}
!101 = !DIEnumerator(name: "RPM_REQ_NONE", value: 0, isUnsigned: true)
!102 = !DIEnumerator(name: "RPM_REQ_IDLE", value: 1, isUnsigned: true)
!103 = !DIEnumerator(name: "RPM_REQ_SUSPEND", value: 2, isUnsigned: true)
!104 = !DIEnumerator(name: "RPM_REQ_AUTOSUSPEND", value: 3, isUnsigned: true)
!105 = !DIEnumerator(name: "RPM_REQ_RESUME", value: 4, isUnsigned: true)
!106 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rpm_status", file: !99, line: 509, baseType: !7, size: 32, elements: !107)
!107 = !{!108, !109, !110, !111}
!108 = !DIEnumerator(name: "RPM_ACTIVE", value: 0, isUnsigned: true)
!109 = !DIEnumerator(name: "RPM_RESUMING", value: 1, isUnsigned: true)
!110 = !DIEnumerator(name: "RPM_SUSPENDED", value: 2, isUnsigned: true)
!111 = !DIEnumerator(name: "RPM_SUSPENDING", value: 3, isUnsigned: true)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dma_data_direction", file: !113, line: 5, baseType: !7, size: 32, elements: !114)
!113 = !DIFile(filename: "./include/linux/dma-direction.h", directory: "/home/qinshisong/clangbuilt-linux")
!114 = !{!115, !116, !117, !118}
!115 = !DIEnumerator(name: "DMA_BIDIRECTIONAL", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "DMA_TO_DEVICE", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "DMA_FROM_DEVICE", value: 2, isUnsigned: true)
!118 = !DIEnumerator(name: "DMA_NONE", value: 3, isUnsigned: true)
!119 = !{!120, !125, !126}
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !121, line: 17, baseType: !122)
!121 = !DIFile(filename: "./include/asm-generic/int-ll64.h", directory: "/home/qinshisong/clangbuilt-linux")
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !123, line: 21, baseType: !124)
!123 = !DIFile(filename: "./include/uapi/asm-generic/int-ll64.h", directory: "/home/qinshisong/clangbuilt-linux")
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pnp_dev", file: !128, line: 245, size: 8000, elements: !129)
!128 = !DIFile(filename: "./include/linux/pnp.h", directory: "/home/qinshisong/clangbuilt-linux")
!129 = !{!130, !4296, !4297, !4298, !4299, !4300, !4301, !4302, !4303, !4328, !4356, !4382, !4425, !4426, !4427, !4428, !4429, !4430, !4431, !4432, !4433, !4434}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !127, file: !128, line: 246, baseType: !131, size: 6080)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !87, line: 969, size: 6080, elements: !132)
!132 = !{!133, !135, !138, !3737, !3738, !3821, !3822, !3909, !3910, !3911, !3912, !3918, !4017, !4029, !4032, !4033, !4034, !4116, !4118, !4119, !4120, !4121, !4127, !4128, !4131, !4134, !4139, !4242, !4243, !4244, !4245, !4246, !4247, !4254, !4285, !4286, !4287, !4290, !4293, !4294, !4295}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !131, file: !87, line: 970, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !131, file: !87, line: 972, baseType: !136, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "device_private", file: !87, line: 32, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !131, file: !87, line: 974, baseType: !139, size: 512, offset: 128)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobject", file: !140, line: 65, size: 512, elements: !141)
!140 = !DIFile(filename: "./include/linux/kobject.h", directory: "/home/qinshisong/clangbuilt-linux")
!141 = !{!142, !146, !153, !155, !237, !334, !3727, !3732, !3733, !3734, !3735, !3736}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !139, file: !140, line: 66, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !139, file: !140, line: 67, baseType: !147, size: 128, offset: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !148, line: 186, size: 128, elements: !149)
!148 = !DIFile(filename: "./include/linux/types.h", directory: "/home/qinshisong/clangbuilt-linux")
!149 = !{!150, !152}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !148, line: 187, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !148, line: 187, baseType: !151, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !139, file: !140, line: 68, baseType: !154, size: 64, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "kset", scope: !139, file: !140, line: 69, baseType: !156, size: 64, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset", file: !140, line: 192, size: 768, elements: !158)
!158 = !{!159, !160, !198, !199}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !157, file: !140, line: 193, baseType: !147, size: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "list_lock", scope: !157, file: !140, line: 194, baseType: !161, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !162, line: 73, baseType: !163)
!162 = !DIFile(filename: "./include/linux/spinlock_types.h", directory: "/home/qinshisong/clangbuilt-linux")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !162, line: 61, size: 32, elements: !164)
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, scope: !163, file: !162, line: 62, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !163, file: !162, line: 62, size: 32, elements: !167)
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !166, file: !162, line: 63, baseType: !169, size: 32)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !162, line: 20, size: 32, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !169, file: !162, line: 21, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !173, line: 61, baseType: !174)
!173 = !DIFile(filename: "./include/asm-generic/qspinlock_types.h", directory: "/home/qinshisong/clangbuilt-linux")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qspinlock", file: !173, line: 31, size: 32, elements: !175)
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !174, file: !173, line: 32, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !174, file: !173, line: 32, size: 32, elements: !178)
!178 = !{!179, !185, !190}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !177, file: !173, line: 33, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !148, line: 178, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 176, size: 32, elements: !182)
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !181, file: !148, line: 177, baseType: !184, size: 32)
!184 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!185 = !DIDerivedType(tag: DW_TAG_member, scope: !177, file: !173, line: 41, baseType: !186, size: 16)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !177, file: !173, line: 41, size: 16, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !186, file: !173, line: 42, baseType: !120, size: 8)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !186, file: !173, line: 43, baseType: !120, size: 8, offset: 8)
!190 = !DIDerivedType(tag: DW_TAG_member, scope: !177, file: !173, line: 45, baseType: !191, size: 32)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !177, file: !173, line: 45, size: 32, elements: !192)
!192 = !{!193, !197}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "locked_pending", scope: !191, file: !173, line: 46, baseType: !194, size: 16)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !121, line: 19, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !123, line: 24, baseType: !196)
!196 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !191, file: !173, line: 47, baseType: !194, size: 16, offset: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !157, file: !140, line: 195, baseType: !139, size: 512, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "uevent_ops", scope: !157, file: !140, line: 196, baseType: !200, size: 64, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kset_uevent_ops", file: !140, line: 156, size: 192, elements: !203)
!203 = !{!204, !209, !214}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !202, file: !140, line: 157, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!184, !156, !154}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !140, line: 158, baseType: !210, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!143, !156, !154}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "uevent", scope: !202, file: !140, line: 159, baseType: !215, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!184, !156, !154, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_uevent_env", file: !140, line: 148, size: 18688, elements: !221)
!221 = !{!222, !227, !231, !232, !236}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !220, file: !140, line: 149, baseType: !223, size: 192)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 192, elements: !225)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!225 = !{!226}
!226 = !DISubrange(count: 3)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "envp", scope: !220, file: !140, line: 150, baseType: !228, size: 2048, offset: 192)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 2048, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "envp_idx", scope: !220, file: !140, line: 151, baseType: !184, size: 32, offset: 2240)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !220, file: !140, line: 152, baseType: !233, size: 16384, offset: 2272)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 16384, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 2048)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !220, file: !140, line: 153, baseType: !184, size: 32, offset: 18656)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ktype", scope: !139, file: !140, line: 70, baseType: !238, size: 64, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_type", file: !140, line: 139, size: 384, elements: !240)
!240 = !{!241, !245, !274, !276, !311, !315}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !239, file: !140, line: 140, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !154}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "sysfs_ops", scope: !239, file: !140, line: 141, baseType: !246, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysfs_ops", file: !249, line: 214, size: 128, elements: !250)
!249 = !DIFile(filename: "./include/linux/sysfs.h", directory: "/home/qinshisong/clangbuilt-linux")
!250 = !{!251, !266}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !248, file: !249, line: 215, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!255, !154, !260, !224}
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !148, line: 60, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ssize_t", file: !257, line: 73, baseType: !258)
!257 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/home/qinshisong/clangbuilt-linux")
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_long_t", file: !257, line: 15, baseType: !259)
!259 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attribute", file: !249, line: 30, size: 128, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !249, line: 31, baseType: !143, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !261, file: !249, line: 32, baseType: !265, size: 16, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "umode_t", file: !148, line: 19, baseType: !196)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !248, file: !249, line: 216, baseType: !267, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DISubroutineType(types: !269)
!269 = !{!255, !154, !260, !143, !270}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !148, line: 55, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !257, line: 72, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !257, line: 16, baseType: !273)
!273 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "default_attrs", scope: !239, file: !140, line: 142, baseType: !275, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "child_ns_type", scope: !239, file: !140, line: 143, baseType: !277, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DISubroutineType(types: !279)
!279 = !{!280, !154}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kobj_ns_type_operations", file: !6, line: 39, size: 384, elements: !283)
!283 = !{!284, !285, !291, !295, !303, !307}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !282, file: !6, line: 40, baseType: !5, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "current_may_mount", scope: !282, file: !6, line: 41, baseType: !286, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !148, line: 30, baseType: !290)
!290 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "grab_current_ns", scope: !282, file: !6, line: 42, baseType: !292, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DISubroutineType(types: !294)
!294 = !{!125}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "netlink_ns", scope: !282, file: !6, line: 43, baseType: !296, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DISubroutineType(types: !298)
!298 = !{!299, !301}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "sock", file: !6, line: 19, flags: DIFlagFwdDecl)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "initial_ns", scope: !282, file: !6, line: 44, baseType: !304, size: 64, offset: 256)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!299}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "drop_ns", scope: !282, file: !6, line: 45, baseType: !308, size: 64, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !125}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "namespace", scope: !239, file: !140, line: 144, baseType: !312, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!299, !154}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "get_ownership", scope: !239, file: !140, line: 145, baseType: !316, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !154, !319, !327}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !321, line: 23, baseType: !322)
!321 = !DIFile(filename: "./include/linux/uidgid.h", directory: "/home/qinshisong/clangbuilt-linux")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 21, size: 32, elements: !323)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !322, file: !321, line: 22, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !148, line: 32, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !257, line: 49, baseType: !7)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "kgid_t", file: !321, line: 28, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 26, size: 32, elements: !330)
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !329, file: !321, line: 27, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !148, line: 33, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_gid32_t", file: !257, line: 50, baseType: !7)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !139, file: !140, line: 71, baseType: !335, size: 64, offset: 384)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_node", file: !337, line: 129, size: 1024, elements: !338)
!337 = !DIFile(filename: "./include/linux/kernfs.h", directory: "/home/qinshisong/clangbuilt-linux")
!338 = !{!339, !340, !341, !342, !343, !351, !352, !353, !3712, !3713, !3722, !3723, !3724}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !336, file: !337, line: 130, baseType: !180, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !336, file: !337, line: 131, baseType: !180, size: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !336, file: !337, line: 141, baseType: !335, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !336, file: !337, line: 142, baseType: !143, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !336, file: !337, line: 144, baseType: !344, size: 192, align: 64, offset: 192)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !345, line: 36, size: 192, align: 64, elements: !346)
!345 = !DIFile(filename: "./include/linux/rbtree.h", directory: "/home/qinshisong/clangbuilt-linux")
!346 = !{!347, !348, !350}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !344, file: !345, line: 37, baseType: !273, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !344, file: !345, line: 38, baseType: !349, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !344, file: !345, line: 39, baseType: !349, size: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !336, file: !337, line: 146, baseType: !299, size: 64, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !336, file: !337, line: 147, baseType: !7, size: 32, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, scope: !336, file: !337, line: 148, baseType: !354, size: 256, offset: 512)
!354 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !336, file: !337, line: 148, size: 256, elements: !355)
!355 = !{!356, !3656, !3660}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !354, file: !337, line: 149, baseType: !357, size: 192)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_elem_dir", file: !337, line: 82, size: 192, elements: !358)
!358 = !{!359, !360, !364}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "subdirs", scope: !357, file: !337, line: 83, baseType: !273, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !357, file: !337, line: 85, baseType: !361, size: 64, offset: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !345, line: 43, size: 64, elements: !362)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !361, file: !345, line: 44, baseType: !349, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !357, file: !337, line: 91, baseType: !365, size: 64, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_root", file: !337, line: 182, size: 768, elements: !367)
!367 = !{!368, !369, !370, !384, !387, !3654, !3655}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "kn", scope: !366, file: !337, line: 184, baseType: !335, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !366, file: !337, line: 185, baseType: !7, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ino_idr", scope: !366, file: !337, line: 188, baseType: !371, size: 192, offset: 128)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "idr", file: !372, line: 19, size: 192, elements: !373)
!372 = !DIFile(filename: "./include/linux/idr.h", directory: "/home/qinshisong/clangbuilt-linux")
!373 = !{!374, !382, !383}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "idr_rt", scope: !371, file: !372, line: 20, baseType: !375, size: 128)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xarray", file: !376, line: 243, size: 128, elements: !377)
!376 = !DIFile(filename: "./include/linux/xarray.h", directory: "/home/qinshisong/clangbuilt-linux")
!377 = !{!378, !379, !381}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "xa_lock", scope: !375, file: !376, line: 244, baseType: !161, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "xa_flags", scope: !375, file: !376, line: 246, baseType: !380, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "gfp_t", file: !148, line: 158, baseType: !7)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "xa_head", scope: !375, file: !376, line: 247, baseType: !125, size: 64, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "idr_base", scope: !371, file: !372, line: 21, baseType: !7, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "idr_next", scope: !371, file: !372, line: 22, baseType: !7, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next_generation", scope: !366, file: !337, line: 189, baseType: !385, size: 32, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !121, line: 21, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !123, line: 27, baseType: !7)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_ops", scope: !366, file: !337, line: 190, baseType: !388, size: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernfs_syscall_ops", file: !337, line: 169, size: 384, elements: !390)
!390 = !{!391, !396, !3638, !3642, !3646, !3650}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !389, file: !337, line: 170, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!184, !365, !395, !224}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !389, file: !337, line: 171, baseType: !397, size: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!184, !400, !365}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_file", file: !402, line: 16, size: 1024, elements: !403)
!402 = !DIFile(filename: "./include/linux/seq_file.h", directory: "/home/qinshisong/clangbuilt-linux")
!403 = !{!404, !405, !406, !407, !408, !409, !413, !414, !418, !436, !458, !459, !3637}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !401, file: !402, line: 17, baseType: !224, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !401, file: !402, line: 18, baseType: !270, size: 64, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !401, file: !402, line: 19, baseType: !270, size: 64, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !401, file: !402, line: 20, baseType: !270, size: 64, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pad_until", scope: !401, file: !402, line: 21, baseType: !270, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !401, file: !402, line: 22, baseType: !410, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "loff_t", file: !148, line: 46, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_loff_t", file: !257, line: 88, baseType: !412)
!412 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !401, file: !402, line: 23, baseType: !410, size: 64, offset: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !401, file: !402, line: 24, baseType: !415, size: 64, offset: 448)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !121, line: 23, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !123, line: 31, baseType: !417)
!417 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !401, file: !402, line: 25, baseType: !419, size: 256, offset: 512)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !420, line: 53, size: 256, elements: !421)
!420 = !DIFile(filename: "./include/linux/mutex.h", directory: "/home/qinshisong/clangbuilt-linux")
!421 = !{!422, !429, !430, !435}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !419, file: !420, line: 54, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !424, line: 24, baseType: !425)
!424 = !DIFile(filename: "./include/asm-generic/atomic-long.h", directory: "/home/qinshisong/clangbuilt-linux")
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !148, line: 183, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !148, line: 181, size: 64, elements: !427)
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !426, file: !148, line: 182, baseType: !259, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !419, file: !420, line: 55, baseType: !161, size: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !419, file: !420, line: 57, baseType: !431, size: 32, offset: 96)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "optimistic_spin_queue", file: !432, line: 15, size: 32, elements: !433)
!432 = !DIFile(filename: "./include/linux/osq_lock.h", directory: "/home/qinshisong/clangbuilt-linux")
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !431, file: !432, line: 20, baseType: !180, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !419, file: !420, line: 59, baseType: !147, size: 128, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !401, file: !402, line: 26, baseType: !437, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seq_operations", file: !402, line: 32, size: 256, elements: !440)
!440 = !{!441, !446, !450, !454}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !439, file: !402, line: 33, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!125, !400, !445}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !439, file: !402, line: 34, baseType: !447, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !400, !125}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !439, file: !402, line: 35, baseType: !451, size: 64, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!125, !400, !125, !445}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !439, file: !402, line: 36, baseType: !455, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DISubroutineType(types: !457)
!457 = !{!184, !400, !125}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !401, file: !402, line: 27, baseType: !184, size: 32, offset: 832)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !401, file: !402, line: 28, baseType: !460, size: 64, offset: 896)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !70, line: 901, size: 2048, align: 32, elements: !463)
!463 = !{!464, !482, !3602, !3603, !3604, !3605, !3606, !3607, !3608, !3609, !3610, !3611, !3620, !3621, !3630, !3631, !3632, !3633, !3634, !3635, !3636}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "f_u", scope: !462, file: !70, line: 905, baseType: !465, size: 128)
!465 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !462, file: !70, line: 902, size: 128, elements: !466)
!466 = !{!467, !473}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "fu_llist", scope: !465, file: !70, line: 903, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !469, line: 70, size: 64, elements: !470)
!469 = !DIFile(filename: "./include/linux/llist.h", directory: "/home/qinshisong/clangbuilt-linux")
!470 = !{!471}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !468, file: !469, line: 71, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "fu_rcuhead", scope: !465, file: !70, line: 904, baseType: !474, size: 128, align: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !148, line: 224, size: 128, align: 64, elements: !475)
!475 = !{!476, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !148, line: 225, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !474, file: !148, line: 226, baseType: !479, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !477}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "f_path", scope: !462, file: !70, line: 906, baseType: !483, size: 128, offset: 128)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "path", file: !484, line: 8, size: 128, elements: !485)
!484 = !DIFile(filename: "./include/linux/path.h", directory: "/home/qinshisong/clangbuilt-linux")
!485 = !{!486, !490}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mnt", scope: !483, file: !484, line: 9, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "vfsmount", file: !489, line: 18, flags: DIFlagFwdDecl)
!489 = !DIFile(filename: "./include/linux/dcache.h", directory: "/home/qinshisong/clangbuilt-linux")
!490 = !DIDerivedType(tag: DW_TAG_member, name: "dentry", scope: !483, file: !484, line: 10, baseType: !491, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dentry", file: !489, line: 88, size: 1536, elements: !493)
!493 = !{!494, !495, !501, !509, !510, !525, !3570, !3572, !3585, !3586, !3587, !3588, !3589, !3594, !3595, !3596}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "d_flags", scope: !492, file: !489, line: 90, baseType: !7, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "d_seq", scope: !492, file: !489, line: 91, baseType: !496, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !497, line: 53, baseType: !498)
!497 = !DIFile(filename: "./include/linux/seqlock.h", directory: "/home/qinshisong/clangbuilt-linux")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !497, line: 48, size: 32, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !498, file: !497, line: 49, baseType: !7, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "d_hash", scope: !492, file: !489, line: 92, baseType: !502, size: 128, offset: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_bl_node", file: !503, line: 38, size: 128, elements: !504)
!503 = !DIFile(filename: "./include/linux/list_bl.h", directory: "/home/qinshisong/clangbuilt-linux")
!504 = !{!505, !507}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !502, file: !503, line: 39, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !502, file: !503, line: 39, baseType: !508, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "d_parent", scope: !492, file: !489, line: 93, baseType: !491, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !492, file: !489, line: 94, baseType: !511, size: 128, offset: 256)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qstr", file: !489, line: 47, size: 128, elements: !512)
!512 = !{!513, !522}
!513 = !DIDerivedType(tag: DW_TAG_member, scope: !511, file: !489, line: 48, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !511, file: !489, line: 48, size: 64, elements: !515)
!515 = !{!516, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, scope: !514, file: !489, line: 49, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !489, line: 49, size: 64, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !517, file: !489, line: 50, baseType: !385, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !517, file: !489, line: 50, baseType: !385, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "hash_len", scope: !514, file: !489, line: 52, baseType: !415, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !511, file: !489, line: 54, baseType: !523, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "d_inode", scope: !492, file: !489, line: 95, baseType: !526, size: 64, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode", file: !70, line: 603, size: 4672, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !537, !538, !695, !3245, !3246, !3247, !3248, !3254, !3255, !3256, !3257, !3258, !3259, !3260, !3261, !3262, !3263, !3264, !3265, !3266, !3267, !3268, !3269, !3270, !3273, !3274, !3275, !3276, !3277, !3278, !3279, !3284, !3285, !3286, !3287, !3288, !3289, !3535, !3543, !3544, !3545, !3563, !3564, !3565, !3566, !3569}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_mode", scope: !527, file: !70, line: 604, baseType: !265, size: 16)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_opflags", scope: !527, file: !70, line: 605, baseType: !196, size: 16, offset: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_uid", scope: !527, file: !70, line: 606, baseType: !320, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_gid", scope: !527, file: !70, line: 607, baseType: !328, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_flags", scope: !527, file: !70, line: 608, baseType: !7, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_acl", scope: !527, file: !70, line: 611, baseType: !535, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "posix_acl", file: !70, line: 574, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_default_acl", scope: !527, file: !70, line: 612, baseType: !535, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_op", scope: !527, file: !70, line: 615, baseType: !539, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inode_operations", file: !70, line: 1823, size: 1536, align: 512, elements: !542)
!542 = !{!543, !547, !557, !561, !565, !569, !573, !577, !581, !585, !589, !590, !596, !600, !624, !652, !656, !681, !686, !690, !691}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !541, file: !70, line: 1824, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!491, !526, !491, !7}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "get_link", scope: !541, file: !70, line: 1825, baseType: !548, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!143, !491, !526, !551}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "delayed_call", file: !553, line: 10, size: 128, elements: !554)
!553 = !DIFile(filename: "./include/linux/delayed_call.h", directory: "/home/qinshisong/clangbuilt-linux")
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !552, file: !553, line: 11, baseType: !308, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !552, file: !553, line: 12, baseType: !125, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "permission", scope: !541, file: !70, line: 1826, baseType: !558, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!184, !526, !184}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "get_acl", scope: !541, file: !70, line: 1827, baseType: !562, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!535, !526, !184}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "readlink", scope: !541, file: !70, line: 1829, baseType: !566, size: 64, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!184, !491, !224, !184}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !541, file: !70, line: 1831, baseType: !570, size: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!184, !526, !491, !265, !289}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !541, file: !70, line: 1832, baseType: !574, size: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DISubroutineType(types: !576)
!576 = !{!184, !491, !526, !491}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "unlink", scope: !541, file: !70, line: 1833, baseType: !578, size: 64, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!184, !526, !491}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "symlink", scope: !541, file: !70, line: 1834, baseType: !582, size: 64, offset: 512)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!184, !526, !491, !143}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mkdir", scope: !541, file: !70, line: 1835, baseType: !586, size: 64, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!184, !526, !491, !265}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rmdir", scope: !541, file: !70, line: 1836, baseType: !578, size: 64, offset: 640)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mknod", scope: !541, file: !70, line: 1837, baseType: !591, size: 64, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!184, !526, !491, !265, !594}
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !148, line: 16, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_dev_t", file: !148, line: 13, baseType: !385)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rename", scope: !541, file: !70, line: 1838, baseType: !597, size: 64, offset: 768)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!184, !526, !491, !526, !491, !7}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "setattr", scope: !541, file: !70, line: 1840, baseType: !601, size: 64, offset: 832)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{!184, !491, !604}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iattr", file: !70, line: 211, size: 640, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !620, !621, !622}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ia_valid", scope: !605, file: !70, line: 212, baseType: !7, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mode", scope: !605, file: !70, line: 213, baseType: !265, size: 16, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ia_uid", scope: !605, file: !70, line: 214, baseType: !320, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ia_gid", scope: !605, file: !70, line: 215, baseType: !328, size: 32, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ia_size", scope: !605, file: !70, line: 216, baseType: !410, size: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ia_atime", scope: !605, file: !70, line: 217, baseType: !613, size: 128, offset: 192)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec64", file: !614, line: 20, size: 128, elements: !615)
!614 = !DIFile(filename: "./include/linux/time64.h", directory: "/home/qinshisong/clangbuilt-linux")
!615 = !{!616, !619}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !613, file: !614, line: 21, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "time64_t", file: !614, line: 7, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !123, line: 30, baseType: !412)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !613, file: !614, line: 22, baseType: !259, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ia_mtime", scope: !605, file: !70, line: 218, baseType: !613, size: 128, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ia_ctime", scope: !605, file: !70, line: 219, baseType: !613, size: 128, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ia_file", scope: !605, file: !70, line: 226, baseType: !623, size: 64, offset: 576)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "getattr", scope: !541, file: !70, line: 1841, baseType: !625, size: 64, offset: 896)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!184, !628, !630, !385, !7}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kstat", file: !632, line: 24, size: 1088, elements: !633)
!632 = !DIFile(filename: "./include/linux/stat.h", directory: "/home/qinshisong/clangbuilt-linux")
!633 = !{!634, !635, !636, !637, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "result_mask", scope: !631, file: !632, line: 25, baseType: !385, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !631, file: !632, line: 26, baseType: !265, size: 16, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !631, file: !632, line: 27, baseType: !7, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "blksize", scope: !631, file: !632, line: 28, baseType: !638, size: 32, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !148, line: 109, baseType: !385)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !631, file: !632, line: 29, baseType: !415, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "attributes_mask", scope: !631, file: !632, line: 30, baseType: !415, size: 64, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ino", scope: !631, file: !632, line: 38, baseType: !415, size: 64, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !631, file: !632, line: 39, baseType: !594, size: 32, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "rdev", scope: !631, file: !632, line: 40, baseType: !594, size: 32, offset: 352)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !631, file: !632, line: 41, baseType: !320, size: 32, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !631, file: !632, line: 42, baseType: !328, size: 32, offset: 416)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !631, file: !632, line: 43, baseType: !410, size: 64, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !631, file: !632, line: 44, baseType: !613, size: 128, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !631, file: !632, line: 45, baseType: !613, size: 128, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !631, file: !632, line: 46, baseType: !613, size: 128, offset: 768)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "btime", scope: !631, file: !632, line: 47, baseType: !613, size: 128, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !631, file: !632, line: 48, baseType: !415, size: 64, offset: 1024)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "listxattr", scope: !541, file: !70, line: 1842, baseType: !653, size: 64, offset: 960)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!255, !491, !224, !270}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fiemap", scope: !541, file: !70, line: 1843, baseType: !657, size: 64, offset: 1024)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!184, !526, !660, !415, !415}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent_info", file: !70, line: 1691, size: 192, elements: !662)
!662 = !{!663, !664, !665, !666}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fi_flags", scope: !661, file: !70, line: 1692, baseType: !7, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "fi_extents_mapped", scope: !661, file: !70, line: 1693, baseType: !7, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fi_extents_max", scope: !661, file: !70, line: 1694, baseType: !7, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "fi_extents_start", scope: !661, file: !70, line: 1695, baseType: !667, size: 64, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fiemap_extent", file: !669, line: 17, size: 448, elements: !670)
!669 = !DIFile(filename: "./include/uapi/linux/fiemap.h", directory: "/home/qinshisong/clangbuilt-linux")
!670 = !{!671, !672, !673, !674, !678, !679}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fe_logical", scope: !668, file: !669, line: 18, baseType: !416, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fe_physical", scope: !668, file: !669, line: 20, baseType: !416, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "fe_length", scope: !668, file: !669, line: 22, baseType: !416, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved64", scope: !668, file: !669, line: 23, baseType: !675, size: 128, offset: 192)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 128, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 2)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fe_flags", scope: !668, file: !669, line: 24, baseType: !386, size: 32, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fe_reserved", scope: !668, file: !669, line: 25, baseType: !680, size: 96, offset: 352)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 96, elements: !225)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "update_time", scope: !541, file: !70, line: 1845, baseType: !682, size: 64, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!184, !526, !685, !184}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_open", scope: !541, file: !70, line: 1846, baseType: !687, size: 64, offset: 1152)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{!184, !526, !491, !623, !7, !265}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tmpfile", scope: !541, file: !70, line: 1849, baseType: !586, size: 64, offset: 1216)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "set_acl", scope: !541, file: !70, line: 1850, baseType: !692, size: 64, offset: 1280)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!184, !526, !535, !184}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_sb", scope: !527, file: !70, line: 616, baseType: !696, size: 64, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_block", file: !70, line: 1384, size: 12288, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !1032, !2853, !2893, !2976, !2980, !2981, !2982, !2983, !2984, !2985, !2986, !2987, !2988, !2993, !2997, !3001, !3002, !3033, !3034, !3037, !3038, !3039, !3080, !3107, !3108, !3109, !3110, !3113, !3115, !3122, !3123, !3125, !3126, !3127, !3186, !3187, !3203, !3204, !3205, !3206, !3209, !3210, !3211, !3236, !3237, !3238, !3239, !3240, !3241, !3242, !3243, !3244}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "s_list", scope: !697, file: !70, line: 1385, baseType: !147, size: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "s_dev", scope: !697, file: !70, line: 1386, baseType: !594, size: 32, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize_bits", scope: !697, file: !70, line: 1387, baseType: !124, size: 8, offset: 160)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "s_blocksize", scope: !697, file: !70, line: 1388, baseType: !273, size: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "s_maxbytes", scope: !697, file: !70, line: 1389, baseType: !410, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "s_type", scope: !697, file: !70, line: 1390, baseType: !705, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_system_type", file: !70, line: 2167, size: 448, elements: !707)
!707 = !{!708, !709, !710, !714, !718, !1011, !1012, !1022, !1025, !1026, !1027, !1029, !1030, !1031}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !706, file: !70, line: 2168, baseType: !143, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "fs_flags", scope: !706, file: !70, line: 2169, baseType: !184, size: 32, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mount", scope: !706, file: !70, line: 2175, baseType: !711, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!491, !705, !184, !143, !125}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "kill_sb", scope: !706, file: !70, line: 2177, baseType: !715, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !696}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !706, file: !70, line: 2178, baseType: !719, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module", file: !13, line: 329, size: 6656, align: 512, elements: !721)
!721 = !{!722, !723, !724, !728, !750, !776, !777, !778, !779, !787, !792, !793, !794, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !864, !868, !886, !887, !891, !892, !893, !894, !903, !925, !926, !929, !932, !933, !934, !935, !936, !941, !942, !984, !985, !986, !987, !989, !993, !994, !998, !999, !1000, !1001, !1002, !1003, !1010}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !720, file: !13, line: 330, baseType: !12, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !720, file: !13, line: 333, baseType: !147, size: 128, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !720, file: !13, line: 336, baseType: !725, size: 448, offset: 192)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 448, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 56)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "mkobj", scope: !720, file: !13, line: 339, baseType: !729, size: 768, offset: 640)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_kobject", file: !13, line: 44, size: 768, elements: !730)
!730 = !{!731, !732, !733, !734, !737}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "kobj", scope: !729, file: !13, line: 45, baseType: !139, size: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !729, file: !13, line: 46, baseType: !719, size: 64, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "drivers_dir", scope: !729, file: !13, line: 47, baseType: !154, size: 64, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mp", scope: !729, file: !13, line: 48, baseType: !735, size: 64, offset: 640)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_param_attrs", file: !13, line: 48, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "kobj_completion", scope: !729, file: !13, line: 49, baseType: !738, size: 64, offset: 704)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !740, line: 26, size: 256, elements: !741)
!740 = !DIFile(filename: "./include/linux/completion.h", directory: "/home/qinshisong/clangbuilt-linux")
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !739, file: !740, line: 27, baseType: !7, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !739, file: !740, line: 28, baseType: !744, size: 192, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !745, line: 38, baseType: !746)
!745 = !DIFile(filename: "./include/linux/wait.h", directory: "/home/qinshisong/clangbuilt-linux")
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !745, line: 34, size: 192, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !746, file: !745, line: 35, baseType: !161, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !746, file: !745, line: 36, baseType: !147, size: 128, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "modinfo_attrs", scope: !720, file: !13, line: 340, baseType: !751, size: 64, offset: 1408)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_attribute", file: !13, line: 52, size: 448, elements: !753)
!753 = !{!754, !755, !760, !764, !768, !772}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !752, file: !13, line: 53, baseType: !261, size: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "show", scope: !752, file: !13, line: 54, baseType: !756, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!255, !751, !759, !224}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "store", scope: !752, file: !13, line: 56, baseType: !761, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!255, !751, !759, !143, !270}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !752, file: !13, line: 58, baseType: !765, size: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !719, !143}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !752, file: !13, line: 59, baseType: !769, size: 64, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!184, !719}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !752, file: !13, line: 60, baseType: !773, size: 64, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !719}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !720, file: !13, line: 341, baseType: !143, size: 64, offset: 1472)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "srcversion", scope: !720, file: !13, line: 342, baseType: !143, size: 64, offset: 1536)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "holders_dir", scope: !720, file: !13, line: 343, baseType: !154, size: 64, offset: 1600)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "syms", scope: !720, file: !13, line: 346, baseType: !780, size: 64, offset: 1664)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_symbol", file: !783, line: 61, size: 64, elements: !784)
!783 = !DIFile(filename: "./include/linux/export.h", directory: "/home/qinshisong/clangbuilt-linux")
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "value_offset", scope: !782, file: !783, line: 62, baseType: !184, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "name_offset", scope: !782, file: !783, line: 63, baseType: !184, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "crcs", scope: !720, file: !13, line: 347, baseType: !788, size: 64, offset: 1728)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !121, line: 20, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !123, line: 26, baseType: !184)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "num_syms", scope: !720, file: !13, line: 348, baseType: !7, size: 32, offset: 1792)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "param_lock", scope: !720, file: !13, line: 352, baseType: !419, size: 256, offset: 1856)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "kp", scope: !720, file: !13, line: 354, baseType: !795, size: 64, offset: 2112)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param", file: !797, line: 71, size: 320, elements: !798)
!797 = !DIFile(filename: "./include/linux/moduleparam.h", directory: "/home/qinshisong/clangbuilt-linux")
!798 = !{!799, !800, !801, !818, !820, !824, !825}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !797, line: 72, baseType: !143, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !796, file: !797, line: 73, baseType: !719, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !796, file: !797, line: 74, baseType: !802, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_param_ops", file: !797, line: 49, size: 256, elements: !805)
!805 = !{!806, !807, !813, !817}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !804, file: !797, line: 51, baseType: !7, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !804, file: !797, line: 53, baseType: !808, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{!184, !143, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !796)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !804, file: !797, line: 55, baseType: !814, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{!184, !224, !811}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !804, file: !797, line: 57, baseType: !308, size: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !796, file: !797, line: 75, baseType: !819, size: 16, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !796, file: !797, line: 76, baseType: !821, size: 8, offset: 208)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "s8", file: !121, line: 16, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s8", file: !123, line: 20, baseType: !823)
!823 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !796, file: !797, line: 77, baseType: !120, size: 8, offset: 216)
!825 = !DIDerivedType(tag: DW_TAG_member, scope: !796, file: !797, line: 78, baseType: !826, size: 64, offset: 256)
!826 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !796, file: !797, line: 78, size: 64, elements: !827)
!827 = !{!828, !829, !836}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !826, file: !797, line: 79, baseType: !125, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !826, file: !797, line: 80, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_string", file: !797, line: 88, size: 128, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "maxlen", scope: !832, file: !797, line: 89, baseType: !7, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !832, file: !797, line: 90, baseType: !224, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !826, file: !797, line: 81, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kparam_array", file: !797, line: 94, size: 256, elements: !840)
!840 = !{!841, !842, !843, !845, !846}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !839, file: !797, line: 96, baseType: !7, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !839, file: !797, line: 97, baseType: !7, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !839, file: !797, line: 98, baseType: !844, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !839, file: !797, line: 99, baseType: !802, size: 64, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !839, file: !797, line: 100, baseType: !125, size: 64, offset: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "num_kp", scope: !720, file: !13, line: 355, baseType: !7, size: 32, offset: 2176)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "num_gpl_syms", scope: !720, file: !13, line: 358, baseType: !7, size: 32, offset: 2208)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_syms", scope: !720, file: !13, line: 359, baseType: !780, size: 64, offset: 2240)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_crcs", scope: !720, file: !13, line: 360, baseType: !788, size: 64, offset: 2304)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "async_probe_requested", scope: !720, file: !13, line: 379, baseType: !289, size: 8, offset: 2368)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_future_syms", scope: !720, file: !13, line: 382, baseType: !780, size: 64, offset: 2432)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gpl_future_crcs", scope: !720, file: !13, line: 383, baseType: !788, size: 64, offset: 2496)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "num_gpl_future_syms", scope: !720, file: !13, line: 384, baseType: !7, size: 32, offset: 2560)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "num_exentries", scope: !720, file: !13, line: 387, baseType: !7, size: 32, offset: 2592)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "extable", scope: !720, file: !13, line: 388, baseType: !857, size: 64, offset: 2624)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exception_table_entry", file: !859, line: 17, size: 96, elements: !860)
!859 = !DIFile(filename: "./arch/x86/include/asm/extable.h", directory: "/home/qinshisong/clangbuilt-linux")
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "insn", scope: !858, file: !859, line: 18, baseType: !184, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fixup", scope: !858, file: !859, line: 18, baseType: !184, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !858, file: !859, line: 18, baseType: !184, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !720, file: !13, line: 391, baseType: !865, size: 64, offset: 2688)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!184}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "core_layout", scope: !720, file: !13, line: 394, baseType: !869, size: 640, align: 512, offset: 3072)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "module_layout", file: !13, line: 290, size: 640, elements: !870)
!870 = !{!871, !872, !873, !874, !875, !876}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !869, file: !13, line: 292, baseType: !125, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !869, file: !13, line: 294, baseType: !7, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "text_size", scope: !869, file: !13, line: 296, baseType: !7, size: 32, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ro_size", scope: !869, file: !13, line: 298, baseType: !7, size: 32, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ro_after_init_size", scope: !869, file: !13, line: 300, baseType: !7, size: 32, offset: 160)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "mtn", scope: !869, file: !13, line: 303, baseType: !877, size: 448, offset: 192)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mod_tree_node", file: !13, line: 285, size: 448, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "mod", scope: !877, file: !13, line: 286, baseType: !719, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !877, file: !13, line: 287, baseType: !881, size: 384, offset: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "latch_tree_node", file: !882, line: 40, size: 384, elements: !883)
!882 = !DIFile(filename: "./include/linux/rbtree_latch.h", directory: "/home/qinshisong/clangbuilt-linux")
!883 = !{!884}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !881, file: !882, line: 41, baseType: !885, size: 384)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 384, elements: !676)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "init_layout", scope: !720, file: !13, line: 395, baseType: !869, size: 640, offset: 3712)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !720, file: !13, line: 398, baseType: !888, offset: 4352)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mod_arch_specific", file: !889, line: 8, elements: !890)
!889 = !DIFile(filename: "./arch/x86/include/asm/module.h", directory: "/home/qinshisong/clangbuilt-linux")
!890 = !{}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "taints", scope: !720, file: !13, line: 400, baseType: !273, size: 64, offset: 4352)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "num_bugs", scope: !720, file: !13, line: 404, baseType: !7, size: 32, offset: 4416)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bug_list", scope: !720, file: !13, line: 405, baseType: !147, size: 128, offset: 4480)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "bug_table", scope: !720, file: !13, line: 406, baseType: !895, size: 64, offset: 4608)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bug_entry", file: !897, line: 23, size: 96, elements: !898)
!897 = !DIFile(filename: "./include/asm-generic/bug.h", directory: "/home/qinshisong/clangbuilt-linux")
!898 = !{!899, !900, !901, !902}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bug_addr_disp", scope: !896, file: !897, line: 27, baseType: !184, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "file_disp", scope: !896, file: !897, line: 33, baseType: !184, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !896, file: !897, line: 35, baseType: !196, size: 16, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !896, file: !897, line: 37, baseType: !196, size: 16, offset: 80)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "kallsyms", scope: !720, file: !13, line: 411, baseType: !904, size: 64, offset: 4672)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mod_kallsyms", file: !13, line: 314, size: 192, elements: !906)
!906 = !{!907, !923, !924}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !905, file: !13, line: 315, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Sym", file: !910, line: 199, baseType: !911)
!910 = !DIFile(filename: "./include/uapi/linux/elf.h", directory: "/home/qinshisong/clangbuilt-linux")
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elf64_sym", file: !910, line: 192, size: 192, elements: !912)
!912 = !{!913, !915, !916, !917, !919, !921}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "st_name", scope: !911, file: !910, line: 193, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Word", file: !910, line: 21, baseType: !386)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "st_info", scope: !911, file: !910, line: 194, baseType: !124, size: 8, offset: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "st_other", scope: !911, file: !910, line: 195, baseType: !124, size: 8, offset: 40)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "st_shndx", scope: !911, file: !910, line: 196, baseType: !918, size: 16, offset: 48)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Half", file: !910, line: 17, baseType: !195)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "st_value", scope: !911, file: !910, line: 197, baseType: !920, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Addr", file: !910, line: 16, baseType: !416)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !911, file: !910, line: 198, baseType: !922, size: 64, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_Xword", file: !910, line: 22, baseType: !416)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "num_symtab", scope: !905, file: !13, line: 316, baseType: !7, size: 32, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "strtab", scope: !905, file: !13, line: 317, baseType: !224, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "core_kallsyms", scope: !720, file: !13, line: 412, baseType: !905, size: 192, offset: 4736)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "sect_attrs", scope: !720, file: !13, line: 415, baseType: !927, size: 64, offset: 4928)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_sect_attrs", file: !13, line: 415, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "notes_attrs", scope: !720, file: !13, line: 418, baseType: !930, size: 64, offset: 4992)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "module_notes_attrs", file: !13, line: 418, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !720, file: !13, line: 423, baseType: !224, size: 64, offset: 5056)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "percpu", scope: !720, file: !13, line: 427, baseType: !125, size: 64, offset: 5120)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "percpu_size", scope: !720, file: !13, line: 428, baseType: !7, size: 32, offset: 5184)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "num_tracepoints", scope: !720, file: !13, line: 432, baseType: !7, size: 32, offset: 5216)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "tracepoints_ptrs", scope: !720, file: !13, line: 433, baseType: !937, size: 64, offset: 5248)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "tracepoint_ptr_t", file: !939, line: 39, baseType: !940)
!939 = !DIFile(filename: "./include/linux/tracepoint-defs.h", directory: "/home/qinshisong/clangbuilt-linux")
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "num_bpf_raw_events", scope: !720, file: !13, line: 436, baseType: !7, size: 32, offset: 5312)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "bpf_raw_events", scope: !720, file: !13, line: 437, baseType: !943, size: 64, offset: 5376)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_raw_event_map", file: !939, line: 44, size: 256, align: 256, elements: !945)
!945 = !{!946, !982, !983}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !944, file: !939, line: 45, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tracepoint", file: !939, line: 30, size: 384, elements: !949)
!949 = !{!950, !951, !970, !971, !975}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !948, file: !939, line: 31, baseType: !143, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !948, file: !939, line: 32, baseType: !952, size: 128, offset: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "static_key", file: !953, line: 87, size: 128, elements: !954)
!953 = !DIFile(filename: "./include/linux/jump_label.h", directory: "/home/qinshisong/clangbuilt-linux")
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !952, file: !953, line: 88, baseType: !180, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, scope: !952, file: !953, line: 102, baseType: !957, size: 64, offset: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !952, file: !953, line: 102, size: 64, elements: !958)
!958 = !{!959, !960, !967}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !957, file: !953, line: 103, baseType: !273, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !957, file: !953, line: 104, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "jump_entry", file: !953, line: 122, size: 128, elements: !963)
!963 = !{!964, !965, !966}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !962, file: !953, line: 123, baseType: !790, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !962, file: !953, line: 124, baseType: !790, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !962, file: !953, line: 125, baseType: !259, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !957, file: !953, line: 105, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "static_key_mod", file: !953, line: 105, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "regfunc", scope: !948, file: !939, line: 33, baseType: !865, size: 64, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "unregfunc", scope: !948, file: !939, line: 34, baseType: !972, size: 64, offset: 256)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{null}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "funcs", scope: !948, file: !939, line: 35, baseType: !976, size: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tracepoint_func", file: !939, line: 24, size: 192, elements: !978)
!978 = !{!979, !980, !981}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !977, file: !939, line: 25, baseType: !125, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !977, file: !939, line: 26, baseType: !125, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !977, file: !939, line: 27, baseType: !184, size: 32, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "bpf_func", scope: !944, file: !939, line: 46, baseType: !125, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "num_args", scope: !944, file: !939, line: 47, baseType: !385, size: 32, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "jump_entries", scope: !720, file: !13, line: 440, baseType: !961, size: 64, offset: 5440)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "num_jump_entries", scope: !720, file: !13, line: 441, baseType: !7, size: 32, offset: 5504)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "num_trace_bprintk_fmt", scope: !720, file: !13, line: 444, baseType: !7, size: 32, offset: 5536)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "trace_bprintk_fmt_start", scope: !720, file: !13, line: 445, baseType: !988, size: 64, offset: 5568)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "trace_events", scope: !720, file: !13, line: 448, baseType: !990, size: 64, offset: 5632)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DICompositeType(tag: DW_TAG_structure_type, name: "trace_event_call", file: !13, line: 448, flags: DIFlagFwdDecl)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "num_trace_events", scope: !720, file: !13, line: 449, baseType: !7, size: 32, offset: 5696)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "trace_evals", scope: !720, file: !13, line: 450, baseType: !995, size: 64, offset: 5760)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "trace_eval_map", file: !13, line: 450, flags: DIFlagFwdDecl)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "num_trace_evals", scope: !720, file: !13, line: 451, baseType: !7, size: 32, offset: 5824)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "source_list", scope: !720, file: !13, line: 468, baseType: !147, size: 128, offset: 5888)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "target_list", scope: !720, file: !13, line: 470, baseType: !147, size: 128, offset: 6016)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "exit", scope: !720, file: !13, line: 473, baseType: !972, size: 64, offset: 6144)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "refcnt", scope: !720, file: !13, line: 475, baseType: !180, size: 32, offset: 6208)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ei_funcs", scope: !720, file: !13, line: 485, baseType: !1004, size: 64, offset: 6272)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "error_injection_entry", file: !1006, line: 14, size: 128, elements: !1007)
!1006 = !DIFile(filename: "./include/asm-generic/error-injection.h", directory: "/home/qinshisong/clangbuilt-linux")
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !1005, file: !1006, line: 15, baseType: !273, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "etype", scope: !1005, file: !1006, line: 16, baseType: !184, size: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "num_ei_funcs", scope: !720, file: !13, line: 486, baseType: !7, size: 32, offset: 6336)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !706, file: !70, line: 2179, baseType: !705, size: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "fs_supers", scope: !706, file: !70, line: 2180, baseType: !1013, size: 64, offset: 384)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !148, line: 190, size: 64, elements: !1014)
!1014 = !{!1015}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1013, file: !148, line: 191, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !148, line: 194, size: 128, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1017, file: !148, line: 195, baseType: !1016, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !1017, file: !148, line: 195, baseType: !1021, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "s_lock_key", scope: !706, file: !70, line: 2182, baseType: !1023, offset: 448)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lock_class_key", file: !1024, line: 426, elements: !890)
!1024 = !DIFile(filename: "./include/linux/lockdep.h", directory: "/home/qinshisong/clangbuilt-linux")
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "s_umount_key", scope: !706, file: !70, line: 2183, baseType: !1023, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "s_vfs_rename_key", scope: !706, file: !70, line: 2184, baseType: !1023, offset: 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "s_writers_key", scope: !706, file: !70, line: 2185, baseType: !1028, offset: 448)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1023, elements: !225)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "i_lock_key", scope: !706, file: !70, line: 2187, baseType: !1023, offset: 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_key", scope: !706, file: !70, line: 2188, baseType: !1023, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "i_mutex_dir_key", scope: !706, file: !70, line: 2189, baseType: !1023, offset: 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "s_op", scope: !697, file: !70, line: 1391, baseType: !1033, size: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "super_operations", file: !70, line: 1899, size: 1600, elements: !1036)
!1036 = !{!1037, !1041, !1045, !1049, !1055, !1059, !1060, !1061, !1065, !1069, !1070, !1071, !1072, !1078, !1082, !1083, !1087, !1088, !1089, !1090, !1094, !1098, !1145, !2839, !2852}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_inode", scope: !1035, file: !70, line: 1900, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!526, !696}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_inode", scope: !1035, file: !70, line: 1901, baseType: !1042, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{null, !526}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "dirty_inode", scope: !1035, file: !70, line: 1903, baseType: !1046, size: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !526, !184}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "write_inode", scope: !1035, file: !70, line: 1904, baseType: !1050, size: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!184, !526, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "writeback_control", file: !70, line: 281, flags: DIFlagFwdDecl)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "drop_inode", scope: !1035, file: !70, line: 1905, baseType: !1056, size: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!184, !526}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "evict_inode", scope: !1035, file: !70, line: 1906, baseType: !1042, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "put_super", scope: !1035, file: !70, line: 1907, baseType: !715, size: 64, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "sync_fs", scope: !1035, file: !70, line: 1908, baseType: !1062, size: 64, offset: 448)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!184, !696, !184}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_super", scope: !1035, file: !70, line: 1909, baseType: !1066, size: 64, offset: 512)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!184, !696}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "freeze_fs", scope: !1035, file: !70, line: 1910, baseType: !1066, size: 64, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "thaw_super", scope: !1035, file: !70, line: 1911, baseType: !1066, size: 64, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "unfreeze_fs", scope: !1035, file: !70, line: 1912, baseType: !1066, size: 64, offset: 704)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "statfs", scope: !1035, file: !70, line: 1913, baseType: !1073, size: 64, offset: 768)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!184, !491, !1076}
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "kstatfs", file: !70, line: 54, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "remount_fs", scope: !1035, file: !70, line: 1914, baseType: !1079, size: 64, offset: 832)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!184, !696, !395, !224}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "umount_begin", scope: !1035, file: !70, line: 1915, baseType: !715, size: 64, offset: 896)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "show_options", scope: !1035, file: !70, line: 1917, baseType: !1084, size: 64, offset: 960)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!184, !400, !491}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "show_devname", scope: !1035, file: !70, line: 1918, baseType: !1084, size: 64, offset: 1024)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "show_path", scope: !1035, file: !70, line: 1919, baseType: !1084, size: 64, offset: 1088)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "show_stats", scope: !1035, file: !70, line: 1920, baseType: !1084, size: 64, offset: 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "quota_read", scope: !1035, file: !70, line: 1922, baseType: !1091, size: 64, offset: 1216)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!255, !696, !184, !224, !270, !410}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "quota_write", scope: !1035, file: !70, line: 1923, baseType: !1095, size: 64, offset: 1280)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!255, !696, !184, !143, !270, !410}
